# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     InfoLib
   Description :
   Author :       zdf's desktop
   date：          2020/6/15
-------------------------------------------------
   Change Activity:
                   2020/6/15:18:42
-------------------------------------------------
"""
import random

bot_join_text = random.choice(["锵锵~!烫烫闪亮登场~", "锟斤拷烫烫烫，就是少侠我~"])
friend_respond = random.choice(["你好呀朋友，找烫烫我什么事情?", "锟斤拷烫烫烫，就是少侠我~", "抱歉，我的主人最近偷懒，还没有写聊天模块呢……烫烫还不能和你聊天呢呜呜呜"])

Help_text = "沙雕机器人烫烫为您服务~烫烫烫……\n" \
            "现在开通的功能有：一言毒鸡汤，每日运势，骰子机等……\n\n" \
            "WOD便携式图书馆 V.2.0\n" \
            "大部分的指令支持简单的自然语言处理，请尽量用一般疑问句检索\n" \
            "示例: 请问五孔镶嵌公式是什么?\n" \
            "经过实验，自然语言的处理误判较多，暂时改回使用.开头进行的查询，示例：.卷轴 .香料 .镶嵌材料 .五孔镶嵌公式 .躲闪\n" \
            ".help\t//帮助，列出帮助\n" \
            ".mosaicist\t//镶嵌师\n" \
            ".mosaic\t//镶嵌材料及种族\n" \
            ".potion\t//属性药剂&技能药剂\n" \
            ".mosaic_formula\t//镶嵌公式\n" \
            ".tune\t//常用鼓励歌曲\n" \
            ".book\t//常用书籍\n" \
            ".herb\t//草药耗材\n" \
            ".dodge\t//闪躲公式\n" \
            ".spicy\t//常用香料\n" \
            ".songbook\t//诗人常用歌曲\n" \
            ".scroll\t//常用卷轴支援/加持耗材\n" \
            ".gods_name\t//各神名具体效果\n" \
            ".blessing\t//祭祀祝福具体效果\n" \
            ".item\t//查询物品(施工中)\n" \
            ".challenge\t//挑战地城及准入条件(施工中)\n" \
            ".skill\t//查询技能(施工中)\n"

Mosaicist_info = "高矮\t：[hero: 6ul7] [hero: 探路者D.va]\n" \
                 "丘矮\t：[hero:爱故乡的花] [hero: 被遗忘的]\n" \
                 "半身\t：[hero: 狗头人皇家厨师长] [hero: 报丧女妖·UC] [hero: 哈娜酱大海盗！] [hero: Clare111]\n" \
                 "林地\t：[hero: 夜神狼歌] [hero: 冷面杀手的小野寺丽]\n" \
                 "M精\t：[hero: M精射手] \n" \
                 "T精\t：[hero: 仙·道友] [hero: 伊尔马特] [hero: 老司机宋哈娜] [hero:“辉月幻影”希莉娅]\n" \
                 "卡拉希\t：[hero: 冷彻的鬼灯] [hero: 小狈重点]\n" \
                 "边塞\t：[hero: 基定·尤拉] [hero: 银色守卫] [hero: 伊莫塔尼斯] [hero:叛逆期的白银圭]\n" \
                 "丁丁\t：[hero: 梦魇异音布瑟拉] [hero: 嘉兰诺德] [hero: Erwin·Delacroix]\n" \
                 "拉沙尼\t：[hero: 伊莫拉图斯] [hero: 神·道友] [hero: 克维苏蒙的永世荒芜] [hero: 万花通灵·妮蔻] [hero: 爱吃叉烧肉的D.va]\n" \
                 "侏儒\t：[hero:机关算尽的四宫辉夜] [hero: 伊露蜜] [hero: 银羽] [hero: 拆解学究达雷迪]\n" \
                 "\n" \
                 "（最后更新于2020/03/04）\n"

Mosaic_info = "高山矮人-->[*宝石砂][金属制盔甲]\n" \
              "丘陵矮人-->[*镶嵌宝石][金属制武器]\n" \
              "半身人-->[*纱线][织品]\n" \
              "林地人-->[*颜料][木制物品]\n" \
              "玛格-莫精灵-->[优质*树脂][木制武器]\n" \
              "提伦-埃精灵-->[*墨汁][羊皮纸]\n" \
              "卡拉希人-->[昂贵的*染料][皮毛]\n" \
              "边塞人-->[*金属片][奢侈装饰品]\n" \
              "丁图安蛮族-->[*浮雕指南][石制物品]\n" \
              "拉沙尼人-->[精制*白垩粉][骨头]\n" \
              "侏儒-->[*皮绑带][皮革衣服]\n"

potion_info = "*智者秃顶*\t智力\n" \
              "*巨魔肌腱*\t力量\n" \
              "*北境柳*\t意志\n" \
              "*铅树心木*\t体质\n" \
              "*蟹蛛丝囊*\t灵巧\n" \
              "*魔鬼爪*\t敏捷\n" \
              "*黑枭眼珠*\t感知\n" \
              "*萤火虫软壳*\t魅力+智力\n" \
              "*银刺嫩叶*\t全属性\n" \
              "----------------\n" \
              "*斑叶防风*\t远程及派生\n" \
              "*龙血树胶*\t近战及派生\n" \
              "*蓝越橘*\t教育\n" \
              "*曼陀罗*\t心灵及心灵护甲\n" \
              "*紫龙舌兰*\t爆破\n" \
              "*血榆实*\t火冰能攻四大法系及其派生\n" \
              "*雪蓟*  \t德鲁伊技能及冰伤冰甲\n" \
              "*白鬼帽*\t预知\n" \
              "*阿伊恩萿*\t领导才能\n" \
              "*毛冬青*\t勇歌嘲弄歌及心防\n" \
              "*莲花芯*\t治疗及其派生\n"

mosaic_formula_info = "（只列出额外属性增益）\n" \
                      ".2s    //（2孔）\n" \
                      ".3s    //（3孔）\n" \
                      ".4s    //（4孔）\n" \
                      ".5s    //（5孔）\n"

two_slots_info = "蓝宝=1魅力"

three_slots_info = "蓝蓝米=1智力\n" \
                   "蓝蓝紫=1意志\n" \
                   "蓝蓝宝=1魅力1感知\n" \
                   "绿绿米=1意志\n" \
                   "黛绿米=2意志\n" \
                   "红红紫=1力量\n" \
                   "红红米=1体质1力量\n" \
                   "黛黛紫=1灵巧\n" \
                   "黛黛米=1感知\n" \
                   "黄黄紫=1感知\n" \
                   "黄紫黛=2敏捷\n" \
                   "黄紫宝=1力量\n" \
                   "绿绿紫=1体质\n" \
                   "黄黄米=1灵巧\n" \
                   "红绿米=2力量\n"

four_slots_info = "绿绿黛米=4意志\n" \
                  "黛黛黄紫=3敏捷1灵巧\n" \
                  "黛A黛B黄紫=4敏捷1灵巧（仅在支持2种材料时可用）\n" \
                  "黛黄黄紫=1感知2敏捷\n" \
                  "蓝蓝米宝=2智力2感知1魅力\n" \
                  "蓝蓝蓝宝=2感知2魅力\n" \
                  "黄宝宝紫=2力量\n" \
                  "黛黛黄米=1感知1意志\n" \
                  "黄红黛米=2意志\n" \
                  "红绿米米=3力量1灵巧\n" \
                  "黄黄米米=2灵巧1智力1感知\n" \
                  "红绿米黛=2力量2意志\n" \
                  "绿A绿B黛米=5意志（仅在支持2种材料时可用）\n" \
                  "红红米米=2体质1力量1灵巧\n "

five_slots_info = "黛A黛B黛黄紫=5敏捷1灵巧（仅在支持2种材料时可用）\n" \
                  "黛黛黛黄紫=4敏捷1灵巧\n" \
                  "黛A黛B宝黄紫=4敏捷1灵巧1力量1感知1意志（仅在支持2种材料时可用）\n" \
                  "黛黛黄黄紫=3敏捷1灵巧1感知\n" \
                  "黛黛黄米紫=3敏捷1灵巧1感知\n" \
                  "黛黛黄宝紫=3敏捷1灵巧1力量1感知1意志\n" \
                  "宝黄红黛紫=2敏捷2意志1力量\n" \
                  "红红米A米B绿=6力量2体质（仅在支持2种材料时可用）\n" \
                  "红红米米绿=4力量2灵巧2体质\n" \
                  "红米米黛绿=3力量1灵巧2意志\n" \
                  "宝宝宝紫黄=3力量\n" \
                  "红红米米紫=2力量1灵巧2体质\n" \
                  "绿绿绿黛米=5意志\n" \
                  "绿绿黛黛米=4意志1感知\n" \
                  "黛黛黄红宝=3意志1感知\n" \
                  "黛黄红宝宝=3意志 \n" \
                  "黛黄红蓝宝=2意志1魅力\n" \
                  "蓝蓝紫米宝=1意志1魅力2智力2感知\n" \
                  "蓝蓝蓝米宝=3感知2智力2魅力\n" \
                  "蓝蓝米宝宝=3感知3智力1魅力\n" \
                  "蓝蓝蓝宝紫=2感知2魅力1意志\n" \
                  "黛黛黄米宝=2感知1意志\n" \
                  "黄黄米米米=3灵巧2智力1感知\n" \
                  "黄黄米米紫=2灵巧2感知1智力\n" \
                  "米米米红红=3体质2力量1灵巧\n"

holy_parade_info = "(只列出套装歌曲)\n" \
                   ".神圣进军之序·战争号召: .34sl近战伤害/.3sl动/13力量\n\n" \
                   ".神圣进军之一·战争誓言: .黑暗/心灵护甲, 少量近战火焰、粉碎、神圣, 4+.17sl神圣援助, .5sl魔法诅咒防御/10%+sl心防\n\n" \
                   "神圣进军之二·圣者训诫: 少量近战火焰、粉碎、神圣, 远程、魔法弹、偷袭、近战、自然、心理、魔法.34-1sl防御\n\n" \
                   "神圣进军之三·无尽黑夜: 双.17力量/.03hl加动/.75sl回蓝, .5sl远近魔攻\n\n" \
                   "神圣进军之四·最后祷告: 黑暗心灵灵体护甲, .17hl+.75sl回蓝/.25sl意志, .25sl领域/防御/领导/援助/社交技能, 双.5诅咒自然心理防御\n\n" \
                   "神圣进军之五·终结宿命: 神圣/龙/巨型/恶魔/神圣伤害, 永久扣除回蓝回血, .25sl体质敏捷力量意志, 无限制.17sl近战/勇气/领域/神圣/领导/战舞/战吼/.25sl援助, " \
                   "无限制双.5sl远近魔攻\n\n" \
                   "神圣进军之六·制裁之日: .25火焰粉碎神圣伤害, .17灵巧智力.34力量, .1近战远程神圣援助.25粉碎等级, 1.25近战.25远程.5魔法\n\n" \
                   "神圣进军之终·凡人伟业: 34%火焰粉碎神圣切割穿刺伤害, 全属性+50%, +1动+0.5SL先攻, 全命中全防御+17%\n\n"

tune_info = "勇气    \t[近战命中]  \n" \
            "胜利    \t[近闪]\n" \
            "顽强    \t[心防]\n" \
            "神圣    \t[心防及神圣伤]\n" \
            "精湛    \t[远程命中]\n" \
            "躲闪飞弹\t[远闪]\n" \
            "回复    \t[回蓝]\n" \
            "查桑    \t[自然防] \n" \
            "迅速    \t[加动]\n" \
            "敏捷    \t[加敏捷]\n"

book_info = "战技    \t[近战技能]\n" \
            "穿山    \t[远程技能]\n" \
            "历法    \t[火焰能量寒冰攻击4法术]\n" \
            "集中注意力\t[先攻]\n" \
            "意志力优势\t[心防魔防]\n" \
            "高闪    \t[远近闪]\n" \
            "防魔    \t[防御魔法]\n" \
            "民兵    \t[远/近/领导技能]\n" \
            "占星    \t[预知/预感等]"

herb_info = "*巨魔*  \t力量\n" \
            "*绿斑鸠*\t病毒防+DR\n" \
            "*红花瓣*\t敏捷先攻\n" \
            "*甜根*  \t魅力回蓝\n" \
            "*醋栗果*\t意志智力\n" \
            "*羽毛叶*\t智力感知\n" \
            "*玛丽约翰娜*\t心防\n" \
            "*薄叶*  \t回血\n" \
            "\n" \
            "[七色花]：\n" \
            "口袋: 白银向日葵 远程\n" \
            "口袋: 紫水晶蝴蝶兰 魔法\n" \
            "口袋: 翡翠秋菊 自然\n" \
            "口袋: 赤红琥珀芍药 爆破\n" \
            "口袋: 黄玉百合 近战\n" \
            "口袋: 黄金玫瑰 心理\n" \
            "口袋: 黑玛瑙郁金香 远近防+病毒\n" \
            "2=使用: 意志+3+13%SL\n" \
            "3=使用: 力/意+3+13%SL 体回/法回+17%SL\n" \
            "4=草药运用+1 使用: 灵/体/敏/力+3+13%SL\n" \
            "5=草药运用+2 使用: 灵/体/敏/感+3+13%SL\n" \
            "6=草药运用+3 使用: 魅/智/敏/感+3+13%SL\n" \
            "7=草药运用+3 草药知识+1 使用: 魅/智/感/意+3+13%SL, 先攻+20%SL\n"

dodge_info = "近战 2*敏捷+灵巧\n" \
             "远程 2*敏捷+感知\n" \
             "魔法 2*意志+智力\n" \
             "心理 2*意志+魅力\n" \
             "诅咒 2*魅力+意志\n" \
             "疾病 2*体质+魅力\n" \
             "陷阱 2*感知+敏捷\n" \
             "自然 2*意志+敏捷\n" \
             "偷袭 2*感知+智力\n" \
             "爆破 2*敏捷+感知\n" \
             "冲击 2*灵巧+力量\n" \
             "魔法弹 2*智力+敏捷\n" \
             "撞击 3*敏捷\n"

scroll_info = "（不包含大部分无限耗材）\n" \
              "辛努安*  近战命中\n" \
              "费欧乃*  回蓝\n" \
              "那拉许*  远程技能\n" \
              "佩雷庶安*  近闪\n" \
              "支援*   敏捷近远闪\n" \
              "精确*   远近命中\n" \
              "觉醒*   灵巧感知先攻\n" \
              "愤怒*   加动扣回血\n" \
              "孤狼*   近闪\n" \
              "迅鼬*   远闪\n" \
              "蔑视*   心防魔防\n" \
              "防毒*   毒dr\n" \
              "完全治愈*  回血\n" \
              "集中注意力* 血量力量扣先攻\n" \
              "防魔卷轴  魔防\n" \
              "防魔*  更多魔防扣回血\n" \
              "雄鹰*  感知\n" \
              "黑熊*  力量\n" \
              "躲避*  远闪\n" \
              "急速*  敏捷先攻\n" \
              "火焰*  近战火伤\n" \
              "毒蛇*  远近毒伤\n" \
              "顽强*  心防"

gods_name_info = "阿克贝斯=魔法防御&心防\n" \
                 "阿克雷斯=远程命中&远闪\n" \
                 "迪莫桑=近战命中&近闪\n" \
                 "拉尚=病毒防\n" \
                 "查桑=自然防\n" \
                 "[完美]\n" \
                 "头部：+2 +0.34HL\n" \
                 "耳环：+2 +0.10HL\n" \
                 "项链：+5 +0.50HL\n" \
                 "手镯：+3 +0.34HL\n" \
                 "腰带：+2 +0.25HL\n" \
                 "戒指：+2 +0.20HL\n" \
                 "[非常优良]\n" \
                 "头部：+2 +0.25HL\n" \
                 "耳环：+2 +0.10HL\n" \
                 "项链：+3 +0.34HL\n" \
                 "手镯：+3 +0.25HL\n" \
                 "腰带：+2 +0.20HL\n" \
                 "戒指：+2 +0.15HL\n" \
                 "--------------------" \
                 "法亚培厄=魔法命中&魔防\n" \
                 "火焰派生类别+1 \n" \
                 "寒冰派生类别+1 \n" \
                 "能量派生类别+1 \n" \
                 "神圣派生类别+1 \n" \
                 "\n" \
                 "阿泽拉丝=心理命中&心防\n" \
                 "心灵派生类别+1 \n" \
                 "领导才能派生类别+1 \n" \
                 "\n" \
                 "费基斯=自然命中&自然防 \n" \
                 "\n" \
                 "耶路奇亚=病毒命中&病毒防\n" \
                 "疫病派生类别+1 \n" \
                 "\n" \
                 "胡托=近战命中&近闪 \n" \
                 "\n" \
                 "古诺=远程命中&远闪\n" \
                 "远程派生类别+1 \n" \
                 "\n" \
                 "弗拉=诅咒命中&诅咒防\n" \
                 "阴影派生类别+1 \n" \
                 "灵魂派生类别+1 \n"

blessing_info = "爱奥拉的奉献 - 魅力，回蓝，治疗技能等级\n" \
                "爱奥拉的援助 - 回血\n" \
                "黑魔法防御术 - 魔抗，诅咒抗，元素DR\n" \
                "迪莫桑净化之火 - 火伤，神圣伤\n" \
                "阿克雷斯的保护 - 陷阱防，偷袭防，陷阱远程DR\n" \
                "阿克雷斯之艺 -  毒DR， 吹管涂毒技能等级，远程偷袭命中\n" \
                "迪莫桑之盾 - 近战DR，近战火DR\n" \
                "塞缪尔神迹 - 力量，盾挡与派生等级，粉碎等级\n" \
                "艾维斯的威信 - 心攻DR，心防技能等级，名誉技能等级\n" \
                "拉尚的平衡 - 心攻DR，病毒与治疗等级，病毒与心攻命中\n" \
                "查桑的暴风 - 动数（3%SL），近战效果，近战防御减值（25%）\n" \
                "迪莫桑的复仇 - 钝器及派生等级和效果\n" \
                "查桑的复仇 - 德鲁伊DR，命中，技能等级，自然命中防御"

spicy_info = "龙涎香 - 智力/魅力/意志\n" \
          "芥子精油 - 先攻动数, 耗蓝\n" \
          "肉蔻 - 魅力/心攻/心防\n" \
          "茴香- 灵巧/感知/远程/爆破\n" \
          "龙脑香 - 智力/回蓝/魔法命中\n" \
          "薰衣草 -  体力恢复/法力恢复，减先攻\n" \
          "忘忧草 - 元素伤害/智力/感知，减法力回复/先攻\n" \
          "迷你桉 - 体质/魅力/病毒命中&防御/自然防御\n" \
          "沉香 - 意志/自然命中&防御\n" \
          "檀香 - 神圣伤害/魅力/自然命中/病毒防御\n" \
          "迷迭香 - 远程攻击&远程派生&远程命中\n"

if __name__ == "__main__":
    pass
